Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/alcohol_and_the_law.html.txt.tmx
Source language: en
Languages: ga

source: Alcohol and the law
ga: Alcól agus an dlí

source: The relevant Irish legislation relating to the serving of alcohol in licensed premises, the buying of alcoholic drinks in off-licences and drinking alcohol in public places is the Intoxicating Liquor Act 2008, Intoxicating Liquor Act 2003, Intoxicating Liquor Act 2000, the Licensing Act, 1872 and the Criminal Justice (Public Order) Act 1994
ga: Is iad an tAcht Deochanna Meisciúla, 2008, an tAcht Deochanna Meisciúla, 2003, an tAcht Deochanna Meisciúla, 2000, an tAcht Ceadúnúcháin, 1872 agus Can tAcht um Cheartas Coiriúil (Ord Poiblí), 1994 an reachtaíocht ábhartha maidir le halcól a dhíol in áitribh cheadúnaithe, le deochanna meisciúla a cheannach i siopaí eischeadúnais agus maidir le halcól a ól in áiteanna poiblí

source: Under the Intoxicating Liquor Acts, it is an offence to sell alcohol to anyone under the age of 18
ga: Faoi na hAchtanna Deochanna Meisciúla, is cion é alcól a dhíol d’aon duine faoi aois 18 mbliana

source: Anyone found guilty of doing so is liable on summary conviction in a District Court to a class C fine
ga: Beidh dliteanas ar aon duine a fhaightear ciontach as é seo a dhéanamh ar ciontú achomair sa Chúirt Dúiche fíneáil aicme C a íoc

source: It is an offence to buy alcohol for people under the age of 18. It is also an offence to give alcohol to anyone under the age of 18 unless in a domestic home and they have parental consent
ga: Is cion é chomh maith alcól a cheannach do dhaoine faoi aois 18 mbliana nó alcól a thabhairt d'aon duine faoi aois 18 mbliana mura ndéantar sa bhaile é agus mura bhfuil cead tuismitheora acu

source: If found guilty of any of these offences, you could be liable on summary conviction in a District Court to a class C fine
ga: Má fhaightear ciontach thú in aon cheann de na cionta seo, d’fhéadfadh dliteanas bheith ort ar ciontú achomair i gCúirt Dúiche agus fineáil aicme C a íoc

source: Young people under the age of 18 are not allowed in licensed premises during extended hours (except in certain circumstances)
ga: Níl cead ag daoine óga faoi aois 18 mbliana a bheith in áitreabh ceadúnaithe le linn uaireanta sínte (seachas faoi chúinsí áirithe)

source: It is the responsibility of the licence holder to make sure this does not happen
ga: Tá sealbhóir an cheadúnais freagrach as a dheimhniú nach dtarlaíonn seo

source: If you are under 18, you cannot legally buy alcohol
ga: Má tá tú faoi aois 18 mbliana, ní féidir leat alcól a cheannach go dlíthiúil

source: Also you cannot drink it unless you are in a private residence and have permission from your parents
ga: Ina theannta sin, ní féidir leat alcól a ól mura bhfuil tú i dteach príobháideach agus go bhfuil agat cead ó do thuismitheoirí

source: It is also an offence to pretend that you are over 18 in order to buy or drink alcohol
ga: Is cion é chomh maith ligean ort go bhfuil tú níos sine ná 18 mbliana chun alcól a cheannach nó a ól

source: If you are found guilty of these offences, you are liable to a class E fine on summary conviction in a District Court
ga: Má fhaightear ciontach thú in aon cheann de na cionta seo, d’fhéadfaí fíneáil aicme E a ghearradh ort ar chiontú achomair i gCúirt Dúiche

source: Conduct in licenced premises
ga: Iompar in áitribh cheadúnaithe

source: Patrons of licenced bars and premises in Ireland are expected to behave at all times with due respect for others
ga: Tá coinne leis go mbíonn dea-iompar ag gach tráth ar chustaiméirí i mbeáir agus in áitribh cheadúnaithe in Éirinn agus go léirítear meas cuí ar dhaoine eile

source: It is an offence under the 2003 Act to supply alcohol to a drunken person and to admit a drunken person to a bar
ga: Is cion é faoi Acht 2003 alcól a sholáthar do dhuine atá ar meisce agus chun cead isteach chuig beár a thabhairt do dhuine atá ar meisce

source: (A 'drunken person' is someone intoxicated to such a degree that they may endanger themselves or other people)
ga: (Duine atá ar meisce a mhéid sin go bhféadfaidís díobháil a dhéanamh dóibh féin nó do dhaoine eile is ea ‘duine ar meisce’)

source: Any licence holder that allows this to occur on their premises is liable on summary conviction to a class B fine for a first offence and a class A fine for any subsequent offence
ga: Beidh dliteanas ar aon sealbhóir ceadúnais a ligeann dó seo tarlú ina n-áitreabh ar ciontú achomair i leith fhíneáil aicme B a íoc i gcás cion chéaduaire agus fíneáil aicme A i gcás cion dara huaire nó i gcás aon chiona dá éis sin

source: It is also an offence to engage in disorderly conduct on a licenced premises in Ireland
ga: Sa mhullach air sin, is cion é páirt a ghlacadh in iompar mí-ordúil in áitribh cheadúnaithe in Éirinn

source: This means that you cannot behave in any way that constitutes a risk to the health, safety or welfare of anyone else on the premises
ga: Ciallaíonn seo nach féidir leat iompar a bheith ar siúl agat ar bhealach a chruthaíonn baol i leith sláinte, sábháilteacht nó leas aon duine eile atá san áitreabh

source: It also means that you cannot behave in a violent, threatening, abusive, insulting or quarrelsome manner
ga: Ciallaíonn sé freisin, nach féidir leat iompar atá ar bhealach foréigneach, bagrach, maslaitheach nó achrannach a bheith ar siúl agat

source: If you are requested to leave a licenced premises by the licence holder or a member of the Gardai, you must do so
ga: Má iarrann an sealbhóir ceadúnais nó ball den Gharda Síochána ort áitreabh ceadúnaithe a fhágáil, ní mór duit amhlaidh a dhéanamh

source: Failure to leave when requested can mean you are liable for a class E fine
ga: Má theipeann ort fágáil nuair a iarrtar ort, d’fheadfá bheith faoi dhliteanas fíneáil aicme E a íoc

source: You may also be arrested by the Gardai
ga: Anuas air sin, d’fhéadfadh an Garda Síochána thú a ghabháil

source: Off-licence sales of alcohol is only permitted between the hours of 10.30 am and 10.00 pm on weekdays and 12.30 pm to 10.00 pm on Sundays
ga: Ní cheadaítear díol alcóil i siopaí eischeadúnais ach amháin idir na huaireanta 10.30rn agus 10.00in i rith na seachtaine agus idir 12.30in agus 10.00in Dé Domhnaigh

source: It is illegal for anyone under the age of 18 to be in an off-licence, unless he or she is with a parent or guardian and all off-licences must display a sign to this effect
ga: Tá sé mídhleathach d’aon duine faoi aois 18 mbliana bheith i siopa eischeadúnais, mura bhfuil tuismitheoir nó caomhnóir leis nó léi agus ní mór do gach siopa eischeadúnais fógra a thaispeáint á chur seo in iúl

source: The sign must be in a prominent place at all times and failure to have such a sign on display can result in a fine
ga: Ba chóir go mbeadh an fógra in áit fheiceálach i gcónaí agus mura ndéantar fógra mar seo a chrochadh, is féidir fíneáil a ghearradh ar an siopa

source: If an off-licence owner is found guilty of allowing under people under 18 onto his or her premises, he or she can be fined
ga: Má fhaightear úinéir siopa eischeadúnais ciontach as ligean do dhaoine faoi 18 mbliana a bheith ina siopa/ina shiopa, is féidir fineáil a ghearradh air nó uirthi

source: People under 18 can themselves be liable for a class E fine if they are found in an off-licence without a parent or guardian
ga: Is féidir fíneáil aicme E a ghearradh ar dhaoine óga iad féin faoi aois 18 mbliana má fhaightear iad i siopa eischeadúnais gan tuismitheoir nó caomhnóir

source: Some offences under the Intoxicating Liquor Act, 2003 (the sale of alcohol to people under 18, allowing people under 18 in licensed premises during extended hours and allowing people under 18 to be in an off-licence unaccompanied) can result in a temporary closure order
ga: Is féidir le hordú dúnta sealadach bheith mar thoradh ar roinnt ciontaí faoin Acht Deochanna Meisciúla, 2003 (díol aclóil le daoine faoi 18 mbliana, ligean do dhaoine faoi 18 mbliana bheith in áitreabh ceadúnaithe le linn uaireanta sínte agus ligean do dhaoine faoi 18 mbliana bheith i siopa eischeadúnais gan tuismitheoir nó caomhnóir)

source: This order is imposed by the District Court in addition to any fine that may be payable by the licence holder
ga: Gearrann an Chúirt Dúiche an t-ordú seo, sa mhullach ar aon fhíneáil a d’fhéadfadh bheith iníoctha ag an sealbhóir ceadúnais

source: The premises must be closed for a period not less than 2 days and not exceeding 7 days for a first offence, or of not less than 7 days and not more than 30 days for a second or any subsequent such offence
ga: Ní mór go mbíonn an t-áitreabh dúnta ar feadh tréimhse nach lú ná 2 lá agus nach faide ná 7 lá i gcás cion chéaduaire, nó nach lú ná 7 lá agus nach mó ná 30 lá i gcás cion dara huaire nó i gcás aon chiona den chineál sin dá éis sin

source: Any premises closed due to a temporary closure order must display a sign outside giving details of the length of the closure and stating that the closure is in compliance with a court order
ga: Ní mór go léireoidh aon áitreabh a dhúntar de bharr ordú dúnta sealadach comhartha lasmuigh a chuireann in iúl fad an dúnta agus a luann go bhfuil an dúnadh i gcomhréir le hordú cúirte

source: In the event of persistent offenders, a court can ultimately demand the forfeiture of a licence
ga: I gcás ciontóirí leanúnacha, is féidir le cúirt, i ndeireadh na dála, forghéilleadh an cheadúnais a iarraidh

source: Children (anyone under the age of 18) are only allowed in licensed premises if they are with a parent or guardian, but this provision carries certain restrictions
ga: Ní cheadaítear do leanaí (aon duine faoi aois 18 mbliana) a bheith in áitreabh ceadúnaithe ach amháin má bhíonn siad i dteannta tuismitheora nó caomhnóra, ach tagann srianta áirithe i gceist leis an bhforáil seo

source: For example if accompanied by a parent/guardian, the child may remain on the premises between the hours of 10:30am - 9pm (10pm May to September) (unless the licence holder feels this is injurious to the child's health, safety and welfare)
ga: Mar shampla, féadann an leanbh fanacht ar an áitreabh idir na huaireanta 10.20rn agus 9in (10in idir Bealtaine agus Meán Fómhair) (mura mbraitheann an sealbhóir ceadúnais go mbeadh sin díobhálach do shláinte, do shábháilteacht nó do leas an linbh sin)

source: Children aged between 15-17 years may remain on the premises after 9pm where they are attending a private function at which a substantial meal is served
ga: Ceadaítear do leanaí idir aois 15 agus 17 mbliana fanacht san áitreabh i ndiaidh 9in sa chás go bhfuil siad ag freastal ar ócáid phríobháideach ina dtugtar dóibh béile substaintiúil

source: All licensed premises must display a sign to this effect in a prominent place at all time and failure to do so can result in a fine
ga: Ní mór don uile áitreabh ceadúnaithe fógra a thaispeáint a chuireann seo in iúl agus é bheith á chrochadh in áit fheiceálach i gcónaí agus is féidir le fíneáil bheith mar thoradh ar theip air seo a dhéanamh

source: If the licence holder is found guilty of allowing unsupervised children in his or her premises, a fine can be imposed on summary conviction in a District Court
ga: Má fhaightear ciontach an sealbhóir ceadúnais as ligean do leanaí gan mhaoirsiú teacht isteach chuig a áitreabh nó a háitreabh, is féidir fíneáil a ghearradh ar ciontú achomair i gCúirt Dúiche

source: Parents and guardians can also be guilty of an offence under the Act if their children are found to be in licensed premises without supervision
ga: Is féidir le tuismitheoirí agus le caomhnóirí a fháil ciontach, freisin, faoin Acht, má fhaightear a leanaí in áitreabh ceadúnaithe gan mhaoirsiú

source: If the parent or guardian cannot prove that the child was there without his or her knowledge or permission, he or she can be liable for a class E fine on summary conviction
ga: Murar féidir leis an tuismitheoir nó an caomhnóir a chruthú go raibh an leanbh ansin i ngan fhios dóibh nó gan cead uathu, is féidir leis no léi bheith faoi dhliteanas fhíneáil aicme E a íoc ar ciontú achomair

source: Selling alcohol at reduced prices 'Happy Hour'
ga: Alcól a dhíol ar phraghsanna laghdaithe ‘Uair an Chloig an tSonais’

source: Since August 2003 it is illegal in Ireland to sell alcohol at reduced prices for a limited period during any day
ga: Ó Lúnasa 2003, tá sé mídhleathach in Éirinn alcól a dhíol ar phraghsanna laghdaithe ar feadh tréimhse theoranta le linn an lae

source: (In other words, 'happy hour' is now prohibited)
ga: (I bhfriotal eile, tá toirmeasc anois ar ‘uair an chloig an tsonais’)

source: Under the Criminal Justice (Public Order) Act 1994, it is an offence for you to be so drunk in a public place that you could reasonably be presumed to be a danger to yourself or to anyone around you
ga: Faoin Acht um Cheartas Coiriúil (Ord Poiblí), 1994, is cion é go mbíonn tú chomh dona sin ar meisce in áit phoiblí gurbh fhéidir le réasún a mheas go bhféadfá díobháil a dhéanamh duit féin nó do dhuine ar bith mórthimpeall ort

source: If found guilty of this offence, you could be liable to a class E fine and a member of the Garda Siochana can confiscate any alcohol you may be carrying
ga: Má fhaightear ciontach thú sa chion seo, d’fhéadfá bheith faoi dhliteanas fíneáil aicme E a íoc agus is féidir le ball den Gharda Síochána aon alcól a d'fhéadfadh bheith á iompar agat a ghabháil

source: It is illegal for a licence holder to sell alcohol in a closed container (i.e., can or bottle) for consumption off the premises in a place 100 metres from the premises
ga: Tá sé mídhleathach go ndíolfaidh sealbhóir ceadúnais alcól i ngabhdán dúnta (i.e. i gcanna nó i mbuidéal) lena ól in áit eile laistigh de 100 méadar ón áitreabh

source: If you purchase alcohol in this way, you could be liable for a class E fine
ga: Má cheannaíonn tú alcól ar an mbealach seo, d’fhéadfá bheith faoi dhliteanas fhíneáil aicme E a íoc

source: While there is no national legislation prohibiting drinking in public, each local authority area is entitled to pass bye-laws prohibiting the consumption of alcohol in a public place
ga: Cé nach ann do reachtaíocht náisúnta a chuireann cosc ar dhaoine a bheith ag ól in áit phoiblí, tá gach limistéar údaráis áitiúil i dteideal fodhlíthe a rith a chuireann toirmeasc ar ól alcóil in áit phoiblí

source: Contact your local authority to find out about these bye-laws in your area
ga: Déan teagmháil le d’údarás áitiúil le faisnéis a fháil faoi na fodhlíthe seo atá i do limistéar

source: Under the Intoxicating Liquor Act 2008 the Gardaí have the power to seize alcohol in the possession of a child under 18 years of age where the Gardaí have reasonable cause to believe that the alcohol will be consumed by a child under 18 years in a public place
ga: Faoin Acht Deochanna Meisciúla, 2008, tá ag an nGarda Síochána an chumhacht alcól atá i seilbh linbh faoi 18 mbliana a ghabháil sa chás go gcreideann an Garda le réasún, go n-ólfaidh leanbh faoi 18 mbliana an t-alcól in áit phoiblí

source: Driving under the influence of alcohol
ga: Ag tiomáint faoi thionchar alcóil

source: Under the Road Traffic Act 2010, it is illegal to drive or be in charge of a vehicle if you are under the influence of alcohol
ga: Faoin Acht um Thrácht ar Bhóithre, 2010, tá sé mídhleathach feithicil a thiomáint nó bheith i gceannas ar fheithicil má tá tú faoi thionchar alcóil

source: The current legal limit is .50mgs of alcohol per 100mgs of blood in the case of experienced drivers, and .20mgs of alcohol per 100mgs of blood in the case of new and professional drivers
ga: Is é an teorann reatha dleathach .50mg alcóil i ngach 100 milleagram fola le haghaidh tiománaithe ag a bhfuil taithí, agus .20mg i ngach 100 milleagram fola le haghaidh tiománaithe nua agus gairmiúla

source: If you are over this limit, you are liable on summary conviction to a class A fine or to imprisonment for a term not exceeding 6 months
ga: Má sháraíonn tú an teorainn seo, d’fhéadfá bheith faoi dhliteanas ar ciontú achomair agus fíneáil aicme A a íoc nó téarma a chaitheamh sa phríosún nach faide ná 6 mhí

source: If the court decides, you could be liable to both
ga: Is féidir leis an gcúirt an cinneadh a dhéanamh tú a chur faoi dhliteanas an dá ruda

source: Anyone found driving while over the legal limit may be disqualified from driving
ga: Déanfar aon duine a fhaightear ag tiomáint thart an teorann dhlítiúil a dhícháiliú ó thiomáint

source: The period of disqualification will usually depend on the level of alcohol consumed
ga: Braithfidh an tréimhse dhícháilithe go hiondúil ar mhéid an alcóil a óladh

source: Read more about driving offences in Ireland here
ga: Is féidir níos mó a léamh faoi chionta tiomána in Éirinn anseo

source: The Gardai (Irish police force) operate the National Age Card scheme
ga: Feidhmíonn an Garda Síochána (fórsa póilíní na hÉireann) scéim an Chárta Náisiúnta Aoise

source: These Cards are proof that the cardholder is 18 or over, they are not identity cards
ga: Cruthaíonn na cártaí seo go bhfuil 18 mbliana ar a laghad slánaithe ag sealbhóir an chárta, ní cártaí aitheantais iad

source: The Card shows the name of the holder, their date of birth, a photograph and a security feature, such as a hologram
ga: Beidh ainm an tsealbhóra ar an gcárta, chomh maith lena d(h)áta breithe, grianghraf agus gné shlándála, ar nós holagraim

source: You can order your Card online at agecard.ie
ga: Is féidir leat ordú do Chárta ar líne ag agecard.ie

source: Anyone found guilty of forging or altering the details on an official Age Card can be liable on summary conviction to a class C fine or to a prison term not exceeding 12 months or to both
ga: D’fhéadfaí fíneáil aicme C a ghearradh ar aon duine a fhaightear ciontach as na sonraí ar Chárta Aoise oifigiúil a bhrionnú nó a athrú nó d’fhéadfaí tréimhse príosúin nach sáraíonn 12 mhí a ghearradh orthu, nó an dá rud araon

source: Licence holders that allow people between 18-21 years on their premises without appropriate identification can face a fine
ga: D’fhéadfaí fíneáil a ghearradh ar shealbhóirí ceadúnais a ligeann do dhaoine idir aois 18 agus 21 bliain bheith ina n-áitreabh gan aitheantas oiriúnach

source: (Appropriate identification includes a National Age Card, a passport, a driving licence, or a identitiy card issued by an EU member state)
ga: (Áirítear le haitheantas oiriúnach Cárta Náisiúta Aoise, pas, ceadúnas tiomána nó cárta aitheantais a eisíonn Ballstáit den AE)
